// 利用モジュール ================================================
import $ from 'jquery'; // jqueryモジュール
import openModal from './modal'; // モーダル関数
import initialize from './load'; // HTML読み込み後の実行関数
// ============================================================

// 要素の初期化及び変数に格納======================================
let newTaskButton = $('.new-task-button');
// ============================================================

// イベントリスナー ==============================================
newTaskButton.on('click', openModal);
// ============================================================

// 初期化及びHTML読み込み時に実行 =================================
window.onload = () => {
  initialize();
};
// ============================================================
