 // =============================================================
 // DOCUMENT
 // =============================================================

 /**
  * app.js     - 複数のファイルをまとめ一つのスクリプトとして出力する
  * drag.js    - リスト要素のドラッグ&ドロップに関係する処理を行う
  * load.js    - ブラウザリロード時、要素の生成やイベントの初期化を行う
  * log.js     - タスク名の履歴に関係する処理を行う
  * modal.js   - モーダル表示に関係する処理を行う
  * storage.js - ローカルストレージを操作する処理を行う
  * view.js    - DOM要素に関係する処理を行う
  */

 // =============================================================

// 利用モジュール ================================================
import * as load from './load'; // HTML読み込み後の実行関数
// ============================================================

// 初期化及びHTML読み込み時に実行 =================================
window.onload = () => {
  // ローカルストレージにデータがある場合、要素を生成する
  load.initialize();
  // イベントリスナーを初期化する
  load.setEvent();
};
// ============================================================
